{
    "contact": "Contact",
    "home": "Home",
    "projects": "Projects",
    "showProjects": "Show Projects",
    "frontend":"Front-End Developer",
    "mobile": "Mobile Developer",
    "heroAbout": {
        "line1": "I'm a software developer passionate about creating useful and powerful solutions that fit in the palm of your hand!",
        "line2": "I started my career in 2021, and since then, I've been accumulating experiences, skills, and connections! I mainly use Kotlin, VUE/NUXT and React Native in my projects.",
        "line3": "I explore new technologies, but I also value solid knowledge within the community, such as Clean Architecture, S.O.L.I.D, and Design Patterns.",
        "line4": "Books that helped me",
        "books": {
            "algorithms": "Grokking Algorithms",
            "man-month": "The Mythical Man-Month",
            "ultralearning": "Ultralearning",
            "patterns": "Design Patterns",
            "clean-code": "Clean Code",
            "clean-arch": "Clean Architecture"
        }
    },
    "projectsData": {
        "vince": {
            "dateInterval": "06/2023 - Current",
            "description": "This application aims to help the user control their finances in an uncomplicated and safe way. I created an intuitive UI to facilitate transaction management using Android MDC features."
        },
        "izapay": {
            "dateInterval": "10/2023 - Current",
            "description": "Responsible for creating screens focused on managing financial and administrative operations, such as generating photos with QR Code and expiration date, complex tables with transactional data, handling multiple simultaneous requests and managing all application states."
        },
        "content": {
            "dateInterval": "02/2024 - Current",
            "description": "I developed the UI of a markdown/yaml content platform, also providing a system for acquiring content in simple, quick and secure ways through subscription plans, where I used NUXT 3 composables to guarantee security in each access to the platform."
        }
    },
    "openSource": "Open Source"
}