{
    "contact": "Contacto",
    "home": "Inicio",
    "projects": "Proyectos",
    "showProjects": "Ver Proyectos",
    "frontend":"Desarrollador Front-End",
    "mobile": "Desarrollador Móvil",
    "heroAbout": {
        "line1": "¡Soy un desarrollador de software apasionado por crear soluciones útiles y potentes que quepan en la palma de tu mano!",
        "line2": "Comencé mi carrera en 2021, ¡desde entonces he acumulado experiencias, habilidades y conexiones! Principalmente utilizo Kotlin, VUE/NUXT y React Native en mis proyectos.",
        "line3": "Exploro nuevas tecnologías, pero también valoro mucho el conocimiento sólido dentro de la comunidad, como Arquitectura Limpia, S.O.L.I.D. y Patrones de Diseño.",
        "line4": "Libros que me han ayudado",
        "books": {
            "algorithms": "Entendiendo Algoritmos",
            "man-month": "El Mítico Hombre-Mes",
            "ultralearning": "Ultraaprendizaje",
            "patterns": "Patrones de Diseño",
            "clean-code": "Código Limpio",
            "clean-arch": "Arquitectura Limpia"
        }
    },
    "projectsData": {
        "vince": {
            "dateInterval": "06/2023 - Actualidad",
            "description": "Esta aplicación tiene como objetivo ayudar al usuario a controlar sus finanzas de manera sencilla y segura. He creado una interfaz intuitiva para facilitar la gestión de transacciones utilizando las funciones de Android MDC."
        },
        "izapay": {
            "dateInterval": "10/2023 - Actualidad",
            "description": "Responsable de crear pantallas enfocadas a gestionar operaciones financieras y administrativas, como generación de fotos con Código QR y tiempo de vencimiento, tablas complejas con datos transaccionales, manejo de múltiples solicitudes simultáneas y gestión de todos los estados de las aplicaciones."
        },
        "content": {
            "dateInterval": "02/2024 - Actualidad",
            "description": "Desarrollé la interfaz de usuario de una plataforma de contenido markdown/yaml, también proporcionando un sistema para adquirir contenido de manera simple, rápida y segura a través de planes de suscripción, donde utilicé composables NUXT 3 para garantizar la seguridad en cada acceso a la plataforma."
        },
        "stoneroyale" : {
            "dateInterval": "Open Source",
            "description": "Aplicación de código abierto desarrollada en Kotlin con Jetpack Compose, con el objetivo de explorar el ecosistema de librerías y framework de Android. En él consumí la API del juego Clash Royale, donde pude simplificar el proceso de búsqueda de perfiles y grupos de jugadores y elementos relacionados, además de explorar animaciones de Android para hacer la UI más agradable e intuitiva."
        }
    },
    "openSource": "Open Source"
}